const tree = {
  id: '1',
  name: 'ЖанахIажи',
  gender: 'male',
  info: 'Представитель одного из трех тухумов, которые основали село. Курайшит.',
  childs: [{
    id: '11',
    name: 'ГIали',
    gender: 'male',
    childs: [
      {
        id: '111',
        name: 'Дwwefewfcqwаци',
        gender: 'male',
        info: 'Погиб вместе с имамом ГъазимухIаммадом при гимринской башне.',
      },
      {
        id: '112',
        name: 'Султанбег',
        gender: 'male',
        info: 'Погиб при отходе имама Шамиля с Ахульго, закрыв имама от пули своей грудью.',
        childs: [
          {
            id: '1121',
            name: 'МуртазгIалихIажи',
            gender: 'male',
            wives: ['113B'],
            childs: [
              {
                id: '11211',
                name: 'Шайихислам',
                gender: 'male',
                childs: [
                  {
                    id: '112111',
                    name: 'Салтанат',
                    gender: 'female',
                  },
                  {
                    id: '112112',
                    name: 'Жагьбат',
                    gender: 'female',
                  },
                  {
                    id: '112113',
                    name: 'Умакусум',
                    gender: 'female',
                  },
                  {
                    id: '112114',
                    name: 'Загьрат',
                    gender: 'female',
                  },
                ],
              },
              {
                id: '11212',
                name: 'ИладихIажи',
                gender: 'male',
                childs: [
                  {
                    id: '112121',
                    name: 'Агъилав',
                    gender: 'male',
                  },
                  {
                    id: '112122',
                    name: 'Наа',
                  },
                  {
                    id: '112123',
                    name: 'Усамат',
                    gender: 'male',
                  },
                ],
              },
              {
                id: '11213',
                name: 'Жамалдин',
                childs: [
                  {
                    id: '112131',
                    name: 'ХIажи',
                  },
                  {
                    id: '112132',
                    name: 'Зайнаб',
                  },
                  {
                    id: '112133',
                    name: 'РайхIанат',
                  },
                  {
                    id: '112134',
                    name: 'МухIаммад',
                  },
                ],
              },
              {
                id: '11214',
                name: 'Султанбег',
                childs: [
                  {
                    id: '112141',
                    name: 'ПатIимат',
                  },
                  {
                    id: '112142',
                    name: 'Гьимат',
                  },
                  {
                    id: '112143',
                    name: 'Сурхай',
                  },
                  {
                    id: '112144',
                    name: 'Хадижат',
                  },
                  {
                    id: '112145',
                    name: 'ГIубайдат',
                  },
                  {
                    id: '112146',
                    name: 'Баху',
                  },
                ],
              },
              {
                id: '11215',
                name: 'Гебек',
                childs: [
                  {
                    id: '112151',
                    name: 'МухIаммад',
                  },
                  {
                    id: '112152',
                    name: 'Написат',
                  },
                ],
              },
            ],
          },
          {
            id: '1122',
            name: 'Хъистаман',
            childs: [
              {
                id: '11221',
                name: 'Дадибика',
                childs: [
                  {
                    id: '112211',
                    name: 'ПатIимат',
                  },
                ],
              }
            ],
          },
        ],
      },
      {
        id: '113',
        name: 'ХIажибег',
        childs: [
          {
            id: '1131',
            name: '???',
          },
          {
            id: '1132',
            name: '???',
            info: 'Неизвестно название и пол.',
            childs: [
              {
                id: '11321',
                name: 'Сада',
              },
              {
                id: '11322',
                name: 'ХIабсат',
                childs: [
                  {
                    id: '113221',
                    name: 'МухIаммад',
                  },
                ],
              },
              {
                id: '11323',
                name: 'ХIаписат',
                childs: [
                  {
                    id: '113231',
                    name: 'Ханзай',
                  },
                  {
                    id: '113232',
                    name: 'ХIабибхIажи',
                  },
                ],
              },
              {
                id: '11324',
                name: 'Ажи',
                childs: [
                  {
                    id: '113241',
                    name: 'МухIаммадхIабиб',
                  },
                  {
                    id: '113242',
                    name: 'МухIаммадсагIид',
                  },
                  {
                    id: '113243',
                    name: 'МухIаммадшапигI',
                  },
                  {
                    id: '113244',
                    name: 'Багьажат',
                  },
                ],
              },
            ],
          },
          {
            id: '1133',
            name: 'СайихIат',
            childs: [
              {
                id: '11331',
                name: 'ГIабдулгIазиз',
                childs: [
                  {
                    id: '113311',
                    name: 'ГIабдулатIип',
                  },
                ],
              },
            ],
          },
          {
            id: '1134',
            name: 'Гебек',
            childs: [
              {
                id: '11341',
                name: 'Халват',
                childs: [
                  {
                    id: '113411',
                    name: 'ГIаишат',
                  },
                ],
              },
            ],
          },
          {
            id: '1135',
            name: '???',
            childs: [
              {
                id: '11351',
                name: 'ГIалихан',
                childs: [
                  {
                    id: '113511',
                    name: 'ГIумахан',
                  },
                  {
                    id: '113512',
                    name: 'Загьират',
                  },
                ],
              },
              {
                id: '11352',
                name: 'ХIадис',
                childs: [
                  {
                    id: '113521',
                    name: 'Аляся',
                  },
                  {
                    id: '113522',
                    name: 'ГIалихан',
                  },
                  {
                    id: '113523',
                    name: 'Зайнап',
                  },
                  {
                    id: '113524',
                    name: 'Аймисе',
                  },
                ],
              },
              {
                id: '11353',
                name: 'ГIабдулмажид',
                childs: [
                  {
                    id: '113531',
                    name: 'Даци',
                  },
                  {
                    id: '113532',
                    name: 'МухIудин',
                  },
                  {
                    id: '113533',
                    name: 'ГIумаханхIажи',
                  },
                ],
              },
            ],
          },
          {
            id: '1136',
            name: '???',
            childs: [
              {
                id: '11361',
                name: 'ГIалихIажи',
                childs: [
                  {
                    id: '113611',
                    name: 'МухIаммад',
                  },
                  {
                    id: '113612',
                    name: 'ГIаза',
                  },
                  {
                    id: '113613',
                    name: 'ГIабдулзагьид',
                  },
                  {
                    id: '113614',
                    name: 'МухIаммадрасул',
                  },
                  {
                    id: '113615',
                    name: 'Пазилат',
                  },
                  {
                    id: '113616',
                    name: 'ПатIимат',
                  },
                  {
                    id: '113617',
                    name: 'Хадижат',
                  },
                ]
              }
            ],
          },
          {
            id: '1137',
            name: 'МирзабегхIажи',
            childs: [
              {
                id: '11371',
                name: 'Горо',
                childs: [
                  {
                    id: '113711',
                    name: 'ГIабдулбасир',
                  },
                  {
                    id: '113712',
                    name: 'Зазай',
                  },
                ],
              },
              {
                id: '11372',
                name: 'Инус',
                childs: [
                  {
                    id: '113721',
                    name: 'Зиявутдин',
                  },
                ],
              },
              {
                id: '11373',
                name: 'ХIада',
                childs: [
                  {
                    id: '113731',
                    name: 'ГIабдулгIазим',
                  },
                  {
                    id: '113732',
                    name: 'Саид',
                  },
                  {
                    id: '113733',
                    name: 'ГIабдулкарим',
                  },
                  {
                    id: '113734',
                    name: 'Яц',
                  },
                ],
              },
              {
                id: '11374',
                name: 'Амирилав',
                childs: [
                  {
                    id: '113741',
                    name: 'Абусаид',
                  },
                ],
              },
              {
                id: '11375',
                name: 'Загьи',
                childs: [
                  {
                    id: '113751',
                    name: 'ГIабдулхIапиз',
                  },
                  {
                    id: '113752',
                    name: 'ГIабдулхIамид',
                  },
                  {
                    id: '113753',
                    name: 'ГIабдулрашид',
                  },
                ],
              },
            ],
          },
          {
            id: '1138',
            name: 'Апи',
            childs: [
              {
                id: '11381',
                name: 'Кехурза',
                childs: [
                  {
                    id: '113811',
                    name: 'Нажмутдим',
                  },
                  {
                    id: '113812',
                    name: 'ПатIимат',
                  },
                  {
                    id: '113813',
                    name: 'Шамсулвара',
                  },
                  {
                    id: '113814',
                    name: 'Сакинат',
                  },
                  {
                    id: '113815',
                    name: 'Сарат',
                  },
                ],
              },
            ],
          },
          {
            id: '1139',
            name: 'ГIалихIажи',
            childs: [
              {
                id: '11391',
                name: 'АхIмадула',
                childs: [
                  {
                    id: '113911',
                    name: 'Расул',
                  },
                ],
              },
              {
                id: '11392',
                name: 'МухIаммадбашир',
                childs: [
                  {
                    id: '113921',
                    name: 'Баху',
                  },
                  {
                    id: '113922',
                    name: 'Анар',
                  },
                  {
                    id: '113923',
                    name: 'Сарат',
                  },
                ],
              },
              {
                id: '11393',
                name: 'ГIусман',
                childs: [
                  {
                    id: '113931',
                    name: '???',
                  },
                  {
                    id: '113932',
                    name: 'ГIиса',
                  },
                  {
                    id: '113933',
                    name: 'Таи-Наа',
                  },
                ],
              },
              {
                id: '11394',
                name: 'ГIумар',
                childs: [
                  {
                    id: '113941',
                    name: 'ХIажи',
                  },
                  {
                    id: '113942',
                    name: 'Юсуп',
                  },
                ],
              },
              {
                id: '11395',
                name: 'ХIажибег',
                childs: [
                  {
                    id: '113951',
                    name: 'Асият',
                  },
                  {
                    id: '113952',
                    name: 'Мансур',
                  },
                  {
                    id: '113953',
                    name: 'Муи',
                  },
                  {
                    id: '113954',
                    name: 'Насир',
                  },
                ],
              },
              {
                id: '11396',
                name: 'ГьайбатИладихIажи',
                childs: [
                  {
                    id: '113961',
                    name: '???',
                  },
                ],
              },
            ],
          },
          {
            id: '113A',
            name: 'ГIумар',
          },
          {
            id: '113B',
            name: 'Сайгибат',
            gender: 'female',
            husband: '1121',
          },
        ],
      }
    ],
  }],
};

export default tree;